# -*- coding: utf-8 -*

#乾一，兑二，离三，震四，巽五，坎六，艮七，坤八
gua = [
	["乾", "夬", "大有", "大壮", "小畜", "需", "大畜", "泰"], 
	["履", "兑", "睽", "归妹", "中孚", "节", "损", "临"],
	["同人", "革", "离", "丰", "家人", "既济", "贲", "明夷"],
	["无妄", "随", "噬嗑", "震", "益", "屯", "颐", "复"],
	["姤", "大过", "鼎", "恒", "巽", "井", "蛊", "升"],
	["讼", "困", "未济", "解", "涣", "坎", "蒙", "师"],
	["遁", "咸", "旅", "小过", "渐", "蹇", "艮", "谦"],
	["否", "萃", "晋", "豫", "观", "比", "剥", "坤"]
]
#乾坤屯蒙需讼师,比小畜兮履泰否,同人大有谦豫随,蛊临观兮噬嗑贲,剥复无妄大畜颐,
#大过坎离三十备.咸恒遁兮及大壮,晋与明夷家人睽,蹇解损益夬姤萃,升困井革鼎震继,
#艮渐归妹丰旅巽,兑涣节兮中孚至,小过既济兼未济,是为下经三十四
order = [
	[1, 43, 14, 34, 9, 5, 26, 11],
	[10, 58, 38, 54, 61, 60, 41, 19],
	[13, 49, 30, 55, 37, 63, 22, 36],
	[25, 17, 21, 51, 42, 3, 27, 24],
	[44, 28, 50, 32, 57, 48, 18, 46],
	[6, 47, 64, 40, 59, 29, 4, 7],
	[33, 31, 56, 62, 53, 39, 52, 15],
	[12, 45, 35, 16, 20, 8, 23, 2],
]
