# -*- coding: utf-8 -*

#乾一，兑二，离三，震四，巽五，坎六，艮七，坤八
#取余为0时,为8
gua = [
	["泰", "乾", "夬", "大有", "大壮", "小畜", "需", "大畜"], 
	["临", "履", "兑", "睽", "归妹", "中孚", "节", "损"],
	["明夷", "同人", "革", "离", "丰", "家人", "既济", "贲"],
	["复", "无妄", "随", "噬嗑", "震", "益", "屯", "颐"],
	["升", "姤", "大过", "鼎", "恒", "巽", "井", "蛊"],
	["师", "讼", "困", "未济", "解", "涣", "坎", "蒙"],
	["谦", "遁", "咸", "旅", "小过", "渐", "蹇", "艮"],
	["坤", "否", "萃", "晋", "豫", "观", "比", "剥"]
]
#乾坤屯蒙需讼师,比小畜兮履泰否,同人大有谦豫随,蛊临观兮噬嗑贲,剥复无妄大畜颐,
#大过坎离三十备.咸恒遁兮及大壮,晋与明夷家人睽,蹇解损益夬姤萃,升困井革鼎震继,
#艮渐归妹丰旅巽,兑涣节兮中孚至,小过既济兼未济,是为下经三十四
order = [
	[11, 1, 43, 14, 34, 9, 5, 26],
	[19, 10, 58, 38, 54, 61, 60, 41],
	[36, 13, 49, 30, 55, 37, 63, 22],
	[24, 25, 17, 21, 51, 42, 3, 27],
	[46, 44, 28, 50, 32, 57, 48, 18],
	[7, 6, 47, 64, 40, 59, 29, 4],
	[15, 33, 31, 56, 62, 53, 39, 52],
	[2, 12, 45, 35, 16, 20, 8, 23],
]
